Repository: MatteoR23/flutainer
Catalog: lib/l10n/app_*.arb
Languages: de, it, pt

# refreshTooltip
source: Refresh
de: Aktualisieren
it: Ricarica
pt: Atualizar

source: Add endpoint
de: Endpoint hinzufügen
it: Aggiungi endpoint
pt: Adicionar endpoint

# heroTitle
source: Welcome to Flutainer
de: Willkommen bei Flutainer
it: Benvenuto su Flutainer
pt: Bem-vindo ao Flutainer

# heroSubtitle
source: Keep your Portainer containers under control everywhere.
de: Behalte deine Portainer-Container überall im Blick.
it: Tieni sotto controllo i container di Portainer ovunque tu sia.
pt: Controle seus containers Portainer em qualquer lugar.

# noEndpointsMessage
source: You haven't configured any endpoints yet. Add one to get started.
de: Du hast noch keine Endpoints konfiguriert. Füge einen hinzu, um zu starten.
it: Non hai ancora configurato endpoint. Aggiungine uno per iniziare.
pt: Você ainda não configurou endpoints. Adicione um para começar.

source: Retry
de: Erneut versuchen
it: Riprova
pt: Tentar novamente

# newEndpointTitle
source: New endpoint
de: Neuer Endpoint
it: Nuovo endpoint
pt: Novo endpoint

# editEndpointTitle
source: Edit endpoint
de: Endpoint bearbeiten
it: Modifica endpoint
pt: Editar endpoint

# nameFieldLabel
source: Name
it: Nome
pt: Nome

# nameFieldHint
source: Production, Demo...
de: Produktion, Demo...
it: Produzione, Demo...
pt: Produção, Demo...

# urlFieldLabel
source: Portainer URL
it: URL Portainer
pt: URL do Portainer

# urlFieldError
source: Enter a valid URL
de: Gib eine gültige URL ein
it: Inserisci un URL valido
pt: Insira uma URL válida

# apiKeyFieldLabel
source: API key
de: API-Schlüssel
pt: Chave API

# apiKeyFieldError
source: Enter an API key
de: Gib einen API-Schlüssel ein
it: Inserisci un'API key
pt: Insira uma chave API

# dialogCancel
source: Cancel
de: Abbrechen
it: Annulla
pt: Cancelar

# dialogSave
source: Save
de: Speichern
it: Salva
pt: Salvar

# endpointCreated
source: Endpoint "{name}" created
de: Endpoint "{name}" erstellt
it: Endpoint "{name}" creato
pt: Endpoint "{name}" criado

source: Endpoint updated
de: Endpoint aktualisiert
it: Endpoint aggiornato
pt: Endpoint atualizado

# deleteEndpointTitle
source: Delete endpoint
de: Endpoint löschen
it: Elimina endpoint
pt: Excluir endpoint

# deleteEndpointMessage
source: Are you sure you want to delete this endpoint? This action cannot be undone.
de: Möchtest du diesen Endpoint wirklich löschen? Das kann nicht rückgängig gemacht werden.
it: Sei sicuro di voler eliminare questo endpoint? L'operazione non Ã¨ reversibile.
pt: Tem certeza de que deseja excluir este endpoint? A ação não pode ser desfeita.

# deleteAction
source: Delete
de: Löschen
it: Elimina
pt: Excluir

source: Endpoint deleted
de: Endpoint gelöscht
it: Endpoint eliminato
pt: Endpoint excluído

# connectAction
source: Connect
de: Verbinden
it: Connetti
pt: Conectar

# editAction
source: Edit
de: Bearbeiten
it: Modifica
pt: Editar

# removeAction
source: Remove
de: Entfernen
it: Rimuovi
pt: Remover

# viewLogAction
source: View log
de: Log anzeigen
it: Vedi log
pt: Ver log

# apiKeyLabel
source: API key: {value}
de: API-Schlüssel: {value}
pt: Chave API: {value}

# emptyValue
source: (empty)
de: (leer)
it: (vuota)
pt: (vazia)

# drawerHome
source: Home
de: Start
pt: Início

# drawerSettings
source: Settings
de: Einstellungen
it: Impostazioni
pt: Configurações

# drawerEmpty
source: No endpoints configured
de: Keine Endpoints konfiguriert
it: Nessun endpoint configurato
pt: Nenhum endpoint configurado

# drawerSubtitle
source: Portainer companion
de: Portainer-Begleiter
it: Compagno per Portainer
pt: Companheiro do Portainer

# settingsTitle
source: Settings
de: Einstellungen
it: Impostazioni
pt: Configurações

# themeTitle
source: Theme
it: Tema
pt: Tema

# themeSystem
source: System
it: Sistema
pt: Sistema

# themeLight
source: Light
de: Hell
it: Chiaro
pt: Claro

# themeDark
source: Dark
de: Dunkel
it: Scuro
pt: Escuro

# languageTitle
source: Language
de: Sprache
it: Lingua
pt: Idioma

# languageSelectLabel
source: Choose a language
de: Sprache auswählen
it: Scegli una lingua
pt: Escolha um idioma

# languageSystemDefault
source: Follow system language
de: Systemsprache verwenden
it: Segui lingua di sistema
pt: Seguir idioma do sistema

# languageEnglish
source: English
de: Englisch
it: Inglese
pt: Inglês

# languageItalian
source: Italian
de: Italienisch
it: Italiano
pt: Italiano

# languageSpanish
source: Spanish
de: Spanisch
it: Spagnolo
pt: Espanhol

# languagePortuguese
source: Portuguese
de: Portugiesisch
it: Portoghese
pt: Português

# languageGerman
source: German
de: Deutsch
it: Tedesco
pt: Alemão

# licenseCardTitle
source: License (MIT)
de: Lizenz (MIT)
it: Licenza (MIT)
pt: Licença (MIT)

# licenseCardSubtitle
source: View license terms
de: Lizenzbedingungen anzeigen
it: Visualizza i termini della licenza
pt: Ver termos da licença

# logCardTitle
source: App logs
it: Log applicazione
pt: Logs do app

# logCardSubtitle
source: Available only in debug
de: Nur im Debug-Modus verfügbar
it: Disponibile solo in debug
pt: Disponível apenas em debug

# licenseTitle
source: MIT License
de: MIT-Lizenz
it: Licenza MIT
pt: Licença MIT

# licenseLoadError
source: Unable to load the license: {details}
de: Lizenz konnte nicht geladen werden: {details}
it: Impossibile caricare la licenza: {details}
pt: Não foi possível carregar a licença: {details}

# debugLogTitle
source: Application logs
de: Anwendungs-Logs
it: Log applicazione
pt: Logs do aplicativo

# debugLogEmpty
source: No logs available
de: Keine Logs verfügbar
it: Nessun log disponibile
pt: Nenhum log disponível

# logClearTooltip
source: Clear logs
de: Logs löschen
it: Svuota log
pt: Limpar logs

# logExportButton
source: Export logs
de: Logs exportieren
it: Esporta log
pt: Exportar logs

# logExportSuccess
source: Logs exported
de: Logs exportiert
it: Log esportati
pt: Logs exportados

# logExportError
source: Unable to export logs: {details}
de: Logs können nicht exportiert werden: {details}
it: Impossibile esportare i log: {details}
pt: Não foi possível exportar os logs: {details}

# logExportInstructions
source: Use Export logs to share a text file, then open an issue on GitHub (MatteoR23/Flutainer) and attach the file.
de: Verwende "Logs exportieren" um eine Textdatei zu teilen und eröffne dann ein Issue auf GitHub (MatteoR23/Flutainer) mit der Datei.
it: Usa Esporta log per condividere un file di testo, quindi apri una issue su GitHub (MatteoR23/Flutainer) e allega il file.
pt: Use Exportar logs para compartilhar um arquivo de texto e abra uma issue no GitHub (MatteoR23/Flutainer) anexando o arquivo.

# environmentLabel
source: Environment
de: Umgebung
pt: Ambiente

# searchHint
source: Search containers...
de: Container suchen...
it: Cerca container...
pt: Buscar containers...

# refreshButton
source: Refresh
de: Aktualisieren
pt: Atualizar

# autoRefreshLabel
source: Auto refresh
pt: Atualização automática

# noEnvironmentsMessage
source: No environments available for this endpoint.
de: Keine Umgebungen für diesen Endpoint verfügbar.
it: Nessun environment disponibile per questo endpoint.
pt: Nenhum ambiente disponível para este endpoint.

# noContainersMessage
source: No containers found for the selected environment.
de: Keine Container für die ausgewählte Umgebung gefunden.
it: Nessun container trovato per l'environment selezionato.
pt: Nenhum container encontrado para o ambiente selecionado.

# noSearchResultsMessage
source: No container matches the search.
de: Kein Container entspricht der Suche.
it: Nessun container corrisponde alla ricerca.
pt: Nenhum container corresponde à pesquisa.

# environmentLoadError
source: Unable to load environments: {details}
de: Umgebungen konnten nicht geladen werden: {details}
it: Impossibile caricare gli environment: {details}
pt: Não foi possível carregar os ambientes: {details}

# containersLoadError
source: Unable to load containers: {details}
de: Container konnten nicht geladen werden: {details}
it: Impossibile caricare i container: {details}
pt: Não foi possível carregar os containers: {details}

# containerActionError
source: Action failed: {details}
de: Aktion fehlgeschlagen: {details}
it: Azione non riuscita: {details}
pt: Ação falhou: {details}

# startAction
source: Start
de: Starten
it: Avvia
pt: Iniciar

# stopAction
source: Stop
de: Stoppen
pt: Parar

# pauseAction
source: Pause
de: Pausieren
it: Pausa
pt: Pausar

# resumeAction
source: Resume
de: Fortsetzen
it: Riprendi
pt: Retomar

# logPreferencesTitle
source: Log preferences
de: Log-Einstellungen
it: Preferenze log
pt: Preferências de log

# linesRefreshTitle
source: Lines & Refresh
de: Zeilen & Aktualisierung
it: Linee e refresh
pt: Linhas e atualização

# linesFieldLabel
source: Lines (default {count})
de: Zeilen (Standard {count})
it: Linee (default {count})
pt: Linhas (padrão {count})

# applyLines
source: Apply
de: Anwenden
it: Applica
pt: Aplicar

# manualRefresh
source: Refresh
de: Aktualisieren
pt: Atualizar

source: Wrap log lines
de: Zeilen umbrechen
it: Vai a capo log
pt: Quebrar linhas

# displayTitle
source: Display
de: Anzeige
it: Visualizzazione
pt: Exibição

# lineNumberOption
source: Line Number
de: Zeilennummer
it: Numero riga
pt: Número da linha

# autoRefreshHint
source: Automatically refresh logs
de: Logs automatisch aktualisieren
it: Aggiorna automaticamente i log
pt: Atualiza os logs automaticamente

# wrapHint
source: Disable to scroll horizontally
de: Zum horizontalen Scrollen deaktivieren
it: Disattiva per scorrere orizzontalmente
pt: Desative para rolar horizontalmente

# containerLogsEmpty
source: No logs available for this container.
de: Für diesen Container sind keine Logs verfügbar.
it: Nessun log disponibile per questo container.
pt: Nenhum log disponível para este container.

# logLoadError
source: Unable to load logs: {details}
de: Logs konnten nicht geladen werden: {details}
it: Impossibile caricare i log: {details}
pt: Não foi possível carregar os logs: {details}

# containerLogsTitle
source: {name} - View Log
de: {name} - Log anzeigen
it: {name} - Vedi log
pt: {name} - Ver log

# linesApplyError
source: Enter a valid number of lines
de: Gib eine gültige Zeilenanzahl ein
it: Inserisci un numero di linee valido
pt: Insira um número de linhas válido

# appLogsInfo
source: Export the file and attach it when opening an issue on GitHub: https://github.com/MatteoR23/Flutainer/issues
de: Exportiere die Datei und füge sie beim Erstellen eines Issues auf GitHub hinzu: https://github.com/MatteoR23/Flutainer/issues
it: Esporta il file e allegalo aprendo una issue su GitHub: https://github.com/MatteoR23/Flutainer/issues
pt: Exporte o arquivo e anexe ao abrir uma issue no GitHub: https://github.com/MatteoR23/Flutainer/issues

# credentialsLoadError
source: Unable to load credentials: {details}
de: Anmeldedaten konnten nicht geladen werden: {details}
it: Impossibile caricare le credenziali: {details}
pt: Não foi possível carregar as credenciais: {details}

# endpointsTitle
source: Endpoints
de: Flutainer - Endpoints
it: Endpoint

# menuTooltip
source: Menu
de: Menü

# containersAppBarTitle
source: Flutainer - Containers
de: Flutainer - Container
it: Flutainer - Container

# timestampOption
source: Timestamp
de: Zeitstempel

# drawerEndpointsHeader
source: Endpoints
it: Endpoint
